СистемаЛиквидацииАкадемическихЗадолженностейСтудентов/src/Documents/ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей/ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей</name>
  <registerRecords>AccumulationRegister.НагрузкаКомиссий</registerRecords>
  <registerRecords>AccumulationRegister.НеявкиНаПересдачи</registerRecords>
  <attributes>
    <name>УчебныйГод</name>
    <type>
      <types>CatalogRef.УчебныеГода</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>CatalogRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <attributes>
    <name>ПреподавательКомиссии</name>
    <type>
      <types>CatalogRef.Преподаватели</types>
    </type>
  </attributes>
  <attributes>
    <name>РольВКомиссии</name>
    <type>
      <types>EnumRef.РольВКомиссии</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЗаседаний</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧасыРаботы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>НазначениеСтудентаДляПреподавателя</name>
    <attributes>
      <name>Студент</name>
      <type>
        <types>CatalogRef.Студенты</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеВида</name>
      <type>
        <types>EnumRef.НаименованиеВида</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПропусков</name>
      <type>
        <types>EnumRef.КоличествоПропусков</types>
      </type>
    </attributes>
    <attributes>
      <name>ПотерянныеЧасыПреподавателя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

СистемаЛиквидацииАкадемическихЗадолженностейСтудентов/src/AccumulationRegisters/НеявкиНаПересдачи/НеявкиНаПересдачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НеявкиНаПересдачи</name>
  <resources>
    <name>КоличествоНеявок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПотерянныеЧасыПреподавателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Преподаватели</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

СистемаЛиквидацииАкадемическихЗадолженностейСтудентов/src/AccumulationRegisters/НагрузкаКомиссий/НагрузкаКомиссий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НагрузкаКомиссий</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоЗаседаний</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЧасыРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Преподаватели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЗадолженности</name>
    <type>
      <types>CatalogRef.ВидЗадолженостей</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

СистемаЛиквидацииАкадемическихЗадолженностейСтудентов/src/Documents/ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр НеявкиНаПересдачи Расход
	Движения.НеявкиНаПересдачи.Записывать = Истина;
	Для Каждого ТекСтрокаНазначениеСтудентаДляПреподавателя Из НазначениеСтудентаДляПреподавателя Цикл
		Движение = Движения.НеявкиНаПересдачи.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Студент = ТекСтрокаНазначениеСтудентаДляПреподавателя.Студент;
		Движение.Дисциплина = Дисциплина;
		Движение.Преподаватель = ПреподавательКомиссии;
		Движение.КоличествоНеявок = ТекСтрокаНазначениеСтудентаДляПреподавателя.КоличествоПропусков;
		Движение.ПотерянныеЧасыПреподавателя = ТекСтрокаНазначениеСтудентаДляПреподавателя.ПотерянныеЧасыПреподавателя;
	КонецЦикла;

	// регистр НагрузкаКомиссий 
	Движения.НагрузкаКомиссий.Записывать = Истина;
	Для Каждого ТекСтрокаНазначениеСтудентаДляПреподавателя Из НазначениеСтудентаДляПреподавателя Цикл
		Движение = Движения.НагрузкаКомиссий.Добавить();
		Движение.Период = Дата;
		Движение.Преподаватель = ПреподавательКомиссии;
		Движение.ВидЗадолженности = ТекСтрокаНазначениеСтудентаДляПреподавателя.НаименованиеВида;
		Движение.КоличествоЗаседаний = КоличествоЗаседаний;
		Движение.ЧасыРаботы = ТекСтрокаНазначениеСтудентаДляПреподавателя.ПотерянныеЧасыПреподавателя;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
